package homework.Homework_21_11_23;

public class Homework {

    /*
    Задача 1

Написать метод, выводящий на печать результат умножения данного числа n
на все целые числа от 0 до n
     */

    public static void main(String[] args){
        int n = 25;
        int i =0;
do {
    System.out.println(n*i);
    i++;
} while (i<=n);

    }
    }


